uhnp/src/DataProcessors/тн_ЗаполнениеПлатежноРасчетныхДокументов/тн_ЗаполнениеПлатежноРасчетныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ЗаполнениеПлатежноРасчетныхДокументов</name>
  <comment>// Юдина Екатерина 23.03.2026 Выполнение задач №000057134</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАванс</name>
      <type>
        <types>DocumentRef.СчетФактураВыданныйАванс</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАвансСумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАвансСуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ОперацияПоПлатежнойКарте</types>
        <types>DocumentRef.КорректировкаРеализации</types>
        <types>DocumentRef.ОтчетБанкаПоОперациямЭквайринга</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.ВзаимозачетЗадолженности</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснованиеНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснованиеДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураВыданный</name>
      <type>
        <types>DocumentRef.СчетФактураВыданный</types>
      </type>
    </attributes>
    <attributes>
      <name>РеализацияТоваровУслуг</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураВыданныйСумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураВыданныйСуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыНаАванс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСчетаФактурыНаАванс</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПустаяПРД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/DataProcessors/тн_ЗаполнениеПлатежноРасчетныхДокументов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    СхемаКомпоновки = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьВОбмен(Команда) 
	
	ЗарегистрироватьВОбменНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда) 
	
	ПерезаполнитьНаСервере(); 
	
КонецПроцедуры  

&НаКлиенте
Процедура ПоказатьНезаполненные(Команда)

	Элементы.ДокументыПоказатьНезаполненные.Пометка = Не Элементы.ДокументыПоказатьНезаполненные.Пометка;
	
	Если Элементы.ДокументыПоказатьНезаполненные.Пометка Тогда
		Элементы.ДокументыПоказатьНезаполненные.Заголовок = "Показать все ПРД"; 
		Элементы.Документы.ОтборСтрок = Новый ФиксированнаяСтруктура("ПустаяПРД", Истина);
	Иначе  		
		Элементы.Документы.ОтборСтрок = Неопределено;
		Элементы.ДокументыПоказатьНезаполненные.Заголовок = "Показать незаполненные ПРД";
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура Инвертировать(Команда)
	
	ИнвертироватьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	ОтметитьВсеНаСервере();
	
КонецПроцедуры
                         
&НаКлиенте
Процедура СнятьОтметки(Команда)
	
	СнятьОтметкиНаСервере();
	
КонецПроцедуры   

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
Процедура ОтметитьВсеНаСервере()
	
	Для Каждого Строка Из Объект.Документы Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьОтметкиНаСервере()
	
	Для Каждого Строка Из Объект.Документы Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры
                   
&НаСервере
Процедура ИнвертироватьНаСервере()
	
	Для Каждого Строка Из Объект.Документы Цикл
		Строка.Пометка = Не Строка.Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	СхемаКомпоновки     = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаКомпоновкиДанных");
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Объект.Период;   
	КонецЕсли;
	Параметр = НастройкиКомпоновки.ПараметрыДанных.Элементы.Найти("Организация");
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Объект.Организация;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновки, НастройкиКомпоновки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаДокументов = Новый ТаблицаЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаДокументов);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Объект.Документы.Загрузить(ТаблицаДокументов);

КонецПроцедуры	

&НаСервере
Процедура ПерезаполнитьНаСервере()
	
	Строки = Объект.Документы.НайтиСтроки(Новый Структура("Пометка", Истина));	
	ДокументыДляЗаполнения = Объект.Документы.Выгрузить(Строки, "СчетФактураВыданный");
	ДокументыДляЗаполнения.Свернуть("СчетФактураВыданный"); 
	
	Для Каждого Строка Из ДокументыДляЗаполнения Цикл	
		
		Если ЗначениеЗаполнено(Строка.СчетФактураВыданный) Тогда
			
			ДокументОбъект = Строка.СчетФактураВыданный.ПолучитьОбъект();
			ТаблицаПлатежноРасчетныеДокументы = ДокументОбъект.ПлатежноРасчетныеДокументы.Выгрузить();
			
			ДокументыОснования = ДокументОбъект.ДокументыОснования.Выгрузить(,"ДокументОснование");
			МассивОснований = ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");  
			
			Документы.СчетФактураВыданный.ЗаполнитьПлатежноРасчетныеДокументы(
				ТаблицаПлатежноРасчетныеДокументы,
				МассивОснований,
				ДокументОбъект.Организация,
				ДокументОбъект.Дата);
				
			ДокументОбъект.ПлатежноРасчетныеДокументы.Загрузить(ТаблицаПлатежноРасчетныеДокументы);
			
			ТаблицаПлатежноРасчетныеДокументы.Свернуть("ДатаПлатежноРасчетногоДокумента, НомерПлатежноРасчетногоДокумента, НомерСчетаФактурыНаАванс, ДатаСчетаФактурыНаАванс, НомерИсправленияСчетаФактурыНаАванс, ДатаИсправленияСчетаФактурыНаАванс", "");
			ТаблицаПлатежноРасчетныеДокументы.Сортировать("ДатаПлатежноРасчетногоДокумента Возр, НомерПлатежноРасчетногоДокумента Возр");
			
			ДокументОбъект.СтрокаПлатежноРасчетныеДокументы = Документы.СчетФактураВыданный.СтрокаРасчетноПлатежныхДокументов(ТаблицаПлатежноРасчетныеДокументы);
			ДокументОбъект.СтрокаАвансовыеСчетаФактуры = Документы.СчетФактураВыданный.СтрокаАвансовыеСчетаФактуры(ТаблицаПлатежноРасчетныеДокументы);
			
			Попытка 
				Если ДокументОбъект.Проведен Тогда 
					ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);      
				Иначе
					ДокументОбъект.Записать(РежимЗаписиДокумента.Запись); 
				КонецЕсли;
			Исключение  
				ОбщегоНазначенияУХ.СообщитьОбОшибке("Не удалось записать документ " + Строка.СчетФактураВыданный + ОписаниеОшибки());
			КонецПопытки; 	
			
			СтрокиДляИзменения = Объект.Документы.НайтиСтроки(Новый Структура("СчетФактураВыданный", Строка.СчетФактураВыданный));	
			
			Если СтрокиДляИзменения.Количество() > 0 Тогда    
				Для Каждого Строка Из ТаблицаПлатежноРасчетныеДокументы Цикл  
					НС = Объект.Документы.Добавить();
					ЗаполнитьЗначенияСвойств(НС, СтрокиДляИзменения[0]);
					ЗаполнитьЗначенияСвойств(НС, Строка, "ДатаПлатежноРасчетногоДокумента, НомерПлатежноРасчетногоДокумента, НомерСчетаФактурыНаАванс, ДатаСчетаФактурыНаАванс");
				КонецЦикла;	 
				
				Для Каждого Строка Из СтрокиДляИзменения Цикл  
					Объект.Документы.Удалить(Строка);  
				КонецЦикла;	   
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Объект.Документы.Сортировать("РеализацияТоваровУслуг Возр");

КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьВОбменНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПланОбмена_Интеграция_УПП_ОКС.Ссылка КАК Ссылка
		|ИЗ
		|	ПланОбмена.тн_Интеграция_УПП_ОКС КАК ПланОбмена_Интеграция_УПП_ОКС
		|ГДЕ
		|	НЕ ПланОбмена_Интеграция_УПП_ОКС.ЭтотУзел
		|	И НЕ ПланОбмена_Интеграция_УПП_ОКС.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка КАК СчетФактураВыданный
		|ИЗ
		|	Документ.СчетФактураВыданный.ПлатежноРасчетныеДокументы КАК СчетФактураВыданныйПлатежноРасчетныеДокументы
		|ГДЕ
		|	СчетФактураВыданныйПлатежноРасчетныеДокументы.Ссылка В(&МассивСФ)";
	
	Строки = Объект.Документы.НайтиСтроки(Новый Структура("Пометка", Истина));	
	МассивСФ = Объект.Документы.Выгрузить(Строки,"СчетФактураВыданный").ВыгрузитьКолонку("СчетФактураВыданный");
	Запрос.УстановитьПараметр("МассивСФ", МассивСФ);	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Выборка = МассивРезультатов[0].Выбрать();
	ВыборкаСФ = МассивРезультатов[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Пока ВыборкаСФ.Следующий() Цикл 
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ВыборкаСФ.СчетФактураВыданный);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти
